# 1.Страхова компанія має 500 договорів страхування життя з 500 клієнтами. 
# Ймовірність настання страхового випадку в цій групі клієнтів однакова і 
# дорівнює 0,002. Величина виплат кожному клієнту однакова і дорівнює 40000 грн. 
# За  яким  законом  розподілена  випадкова  величина кількості страхових  випадків?  
# Побудуйте  графік  закону  розподілу  сумарної величини  виплат  страхової  компанії. 
# Обчисліть  ймовірність  того,  що страхова компанія виплатить своїм клієнтам не більше 
# 100 тис. грн. 

# 0.002   Ймовірність настання страхового випадку
# 500     Кількість клієнтів
# 40000   Сума виплати

# Обчислення ймовірностей відповідно до біноміального розподілу
probabilities <- dbinom(0:500, 500, 0.002)
round(probabilities,10)
# Графік розподілу
plot(c(0:500*40000), probabilities, type = "p", lwd = 10, col = "purple", 
     main = "Біноміальний розподіл сумарної виплати", 
     xlab = "Кількість виплат", 
     ylab = "Ймовірність")

cat('Ймовірність, що виплата не перевищить 100000 грн:', 
    pbinom(100000 / 40000, 500, 0.002))

 
# 2.Побудуйте біноміальнийзакон розподілу із параметрами n=1000, p=0,25. 

rbinom(n=1000, size=1000, prob=0.25)
hist(rbinom(1000, 1000, 0.25))


# 3.Згенеруйте 100 випадкових чисел та зобразіть графічно закон розподілу Пуассона із 
# параметром λ=10. 

barplot(table(rpois(100, 10)), 
        main = "Закон розподілу Пуассона", 
        col = "purple",
        xlab = "Значення", 
        ylab = "Частота")


# 4.Обчисліть  ймовірність  того,  що  випадкова  величина,  розподілена
# за законом  розподілу Пуассона із  параметром  λ=7,  набуватиме  значень  з проміжку 
# [5; 10].

cat('Ймовірність для інтервалу [5; 10]:', 
    ppois(10, 7) - ppois(5 - 1, 7))


# 5.Зобразіть графіки функції та щільності розподілу рівномірно розподіленої 
# випадкової величини на проміжку [15; 25]. 

x <- runif(n = 100, max =100)
prob_cdf <- punif(x, min = 15, max = 25)  # Графік функції розподілу
prob_pdf <- dunif(x, min = 15, max = 25)  # Графік щільності розподілу
par(mfrow=c(1,2))
plot(x, prob_cdf, type = "l", 
     xlab = "Значення", ylab = "Ймовірність", main = "Графік функції розподілу")
plot(x, prob_pdf, type = "l", 
     xlab = "Значення", ylab = "Щільність ймовірності", main = "Графік щільності розподілу")

# 6.Згенеруйте 500 рівномірно розподілених випадкових величин в межах від 50 до 100.
# Зобразіть графічно отриманий розподіл. 

rand <- runif(0:500, min = 50, max = 100)

hist(rand, breaks = 30, 
     col = "mediumorchid", 
     xlab = "Значення", 
     ylab = "Частота",
     main = "Рівномірно розподілені випадкові величини")

# 7.Згенеруйте сукупність із 50 значень випадкової величини, розподіленої за 
# експоненціальним  законом  розподілу  із  параметром  λ=105.  Зобразіть графічно 
# експоненціальний закон розподілу із цим параметром.

exponential <- dexp(x = 0:50, rate = 105)
exponential
 
hist(exponential, col = "mediumorchid",
     xlab = "Значення",
     ylab = "Частота",
     main = "Експоненціальний закон розподілу (λ = 105)")

# 8.Обчисліть  ймовірність  того,  що  випадкова величина,  розподілена  
# за експоненціальним   законом   розподілу   із   параметром   λ=10,   
# не перевищуватиме значення 7. 

pexp(7, 0.1)

# 9.Виведіть  набір  із  200  випадкових  чисел,  розподілених  за  
# стандартним нормальним розподілом.

rnorm(200, mean = 0, sd=1)

# 10.Обчисліть  ймовірність  того,  що  випадкова  величина,  розподілена 
# за нормальним  законом  розподілу із  параметрами  α=20,  σ=87  набуватиме
# значень  з  проміжку  [14;  70]. Побудуйте  графіки  функції  та  щільності 
# такого розподілу.

x <- seq(14,70,by=1)
prob <- pnorm(70, mean = 20, sd = 87) - pnorm(14, mean = 20, sd = 87)
cat("Ймовірність:", prob, "\n")
par(mfrow=c(1,2))
plot(pnorm(x, mean = 20, sd = 87),type = 'p', col = "mediumpurple1", 
      xlab = "Значення", ylab = "Ймовірність", main = "Графік функції розподілу")

plot(dnorm(x, mean = 20, sd = 87),type = 'p', col = "darkolivegreen1", 
      xlab = "Значення", ylab = "Щільність ймовірності", main = "Графік щільності розподілу")

